environment/openfoam/case_template/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
// __BLOCK_MESH_VERTICES_BEGIN__
    (-3 -2 -2)
    ( 5 -2 -2)
    ( 5  2 -2)
    (-3  2 -2)
    (-3 -2  2)
    ( 5 -2  2)
    ( 5  2  2)
    (-3  2  2)
// __BLOCK_MESH_VERTICES_END__
);

blocks
(
// __BLOCK_MESH_BLOCK_BEGIN__
    hex (0 1 2 3 4 5 6 7) (96 48 48) simpleGrading (1 1 1)
// __BLOCK_MESH_BLOCK_END__
);

edges ();

boundary
(
    farField
    {
        type patch;
        faces
        (
            (0 3 7 4)
            (1 5 6 2)
            (0 4 5 1)
            (3 2 6 7)
            (0 1 2 3)
            (4 7 6 5)
        );
    }
);

mergePatchPairs ();
