environment/openfoam/case_template/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    auv
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    farField
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
}
