environment/openfoam/case_template/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e-6;

boundaryField
{
    auv
    {
        type            kqRWallFunction;
        value           uniform 1e-6;
    }
    farField
    {
        type            freestream;
        freestreamValue uniform 1e-6;
        value           uniform 1e-6;
    }
}
