environment/openfoam/case_template/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    auv
    {
        type            nutkWallFunction;
        // __WALL_FUNCTION_BLENDING__
        value           uniform 0;
    }
    farField
    {
        type            calculated;
        value           uniform 0;
    }
}
