environment/openfoam/case_template/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1;

boundaryField
{
    auv
    {
        type            omegaWallFunction;
        // __WALL_FUNCTION_BLENDING__
        value           uniform 1;
    }
    farField
    {
        type            freestream;
        freestreamValue uniform 1;
        value           uniform 1;
    }
}
