environment/openfoam/case_template/0/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}

dimensions      [0 1 0 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    auv
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    farField
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}
