environment/openfoam/case_template/system/meshQualityDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict;
}

maxNonOrtho            70;
maxBoundarySkewness    20;
maxInternalSkewness    4;
maxConcave             80;
minVol                 1e-15;
minTetQuality          1e-30;
minArea                -1;
minTwist               0.02;
minDeterminant         0.001;
minFaceWeight          0.02;
minVolRatio            0.01;
minTriangleTwist       -1;
nSmoothScale           4;
errorReduction         0.75;

relaxed
{
    maxNonOrtho        75;
}
